<?php
//
// kleeja language, install
// Arabic
//


return array(
	'DIR'		=>'rtl',
	'INST_INSTALL_WIZARD'		=>'معالج تثبيت كليجا',
	'INST_INSTALL_CLEAN_VER'		=>"تثبيت نسخة جديدة ",
	'INST_UPDATE_P_VER'		=>"تحديث نسخة سابقة ",
	'INST_AGR_LICENSE'		=>'أوافق على شروط ترخيص إستخدام كليجا .',
	'INST_NEXT'		=>'التالي',
	'INST_PREVIOUS'		=>'السابق',
	'INST_SITE_INFO'		=>'أدخل بيانات المركز',
	'INST_ADMIN_INFO'		=>'أدخل بيانات مدير المركز',
	'INST_CHANG_CONFIG'		=>'بعض البيانات المهمه ناقصه إملأ ملف config.php',
	'INST_CONNCET_ERR'		=>'لا يمكن الإتصال ...',

	'INST_NO_WRTABLE'		=>'مجلد غير قابل للكتابه .. يحتاج تصريح 777',
	'INST_GOOD_GO'		=>'تم التأكد من المتغييرات والإتصال والتراخيص .. تابع',
	'INST_MSGINS'		=>'يمكنك تحميل ماتشاء وفق المسموح به .. شكراُ لزيارتك',
	'INST_CRT_CALL'		=>'تم إنشاء جدول المراسلات',
	'INST_CRT_ONL'		=>'تم إنشاء جدول المتواجدون الآن',
	'INST_CRT_REPRS'		=>'تم إنشاء جدول التبليغات',
	'INST_CRT_STS'		=>'تم إنشاء جدول الإحصائيات',
	'INST_CRT_USRS'		=>'تم إنشاء جدول الأعضاء',
	'INST_CRT_ADM'		=>'تم إدخال معلومات المسؤول',
	'INST_CRT_FLS'		=>'تم إنشاء جدول الملفات',
	'INST_CRT_CNF'		=>'تم إنشاء جدول الإعدادات',
	'INST_CRT_EXT'		=>'تم إنشاء جدول الإمتدادات',
	'INST_CRT_HKS'		=>'تم إنشاء جدول الهاكات',
	'INST_CRT_LNG'		=>'تم إنشاء جدول اللغه',
	'INST_CRT_PLG'		=>'تم إنشاء جدول الإضافات',
	'INST_SQL_ERR'		=>'خطأ في تنفيذ الإستعلام',
	'INST_FINISH_SQL'		=>'تم تثبيت كليجا بنجاح',
	'INST_NOTES'		=>'ملاحظات التثبيت',
	'INST_END'		=>'معالج التثبيت انتهى، يجب الآن حذف مجلد INSTALL <span style="color:red">(الموقع لن يعمل في حال وجود المجلد)</span>',
	'INST_NOTE_D'		=>'أي ملاحظات أو مشاكل تتعلق بأداء كليجا، نرجوا التواصل مع مطوري كليجا!',
	'INST_FINISH_ERRSQL'		=>'هناك مشكله تعيق التثبيت، تأكد من حساب مستخدم القاعدة وحاول مجدداً او استفسر من مطوري كليجا',
	'INST_KLEEJADEVELOPERS'		=>'شكراً لإستخدامك كليجا ... مع أحلى و أطيب التمنيات .. من فريق عمل كليجا',
	'SITENAME'		=>'اسم الموقع',
	'SITEURL'		=>'رابط الموقع',
	'SITEMAIL'		=>'بريد الموقع',
	'USERNAME'		=>'اسم المستخدم',
	'PASSWORD'		=>'كلمة المرور',
	'PASSWORD2'		=>'أعد كلمة المرور',
	'EMAIL'		=>'البريد الالكتروني',
	'INDEX'		=>'الرئيسيه',
	'ADMINCP'		=>'لوحة التحكم',
	'EMPTY_FIELDS'		=>'هناك حقول مهمه, تركتها فارغه...',
	'WRONG_EMAIL'		=>'البريد الإلكتروني خاطئ!',
	//
	
	'DB_INFO_NW'		=>'أدخل بيانات القاعدة بشكل صحيح ، واضغط على (تصدير الملف)وسيقوم المعالج بتصدير ملف config.php لتضعه في مجلد السكربت الرئيسي  كما يتضح لك بالصورة!',
	'DB_INFO'		=>'أدخل معلومات قاعدة البيانات',
	'DB_SERVER'		=>'الخادم',
	'DB_TYPE'		=>'نوع قاعده البيانات',
	'DB_TYPE_MYSQL'		=>'MySQL القياسي',
	'DB_TYPE_MYSQLI'		=>'MySQL المطور',
	'DB_USER'		=>'اسم المستخدم لقاعدة البيانات',
	'DB_PASSWORD'		=>'كلمة المرور لقاعدة البيانات',
	'DB_NAME'		=>'إسم قاعدة البيانات',
	'DB_PREFIX'		=>'بادئة الجداول',
	'VALIDATING_FORM_WRONG'		=>'يبدو أنك تركت أحد الحقول المطلوبه فارغاً ...',
	'CONFIG_EXISTS'		=>'تم إيجاد ملف config.php قم بالمتابعه ...',
	'INST_SUBMIT_CONFIGOK'		=>'أرفع ملف config.php في دليل كليجا الرئيسي وتابع عملية التثبيت !',
	'INST_EXPORT'		=>'تصدير الملف',
	'INST_OTHER_INFO'		=>'معلومات اخرى',
	'URLS_TYPES'		=>'شكل روابط الملفات',
	'DEFAULT'		=>'الافتراضي - ينصح به',
	'FILENAME_URL'		=>'اسماء الملفات',
	'DIRECT_URL'		=>'روابط مباشره - لايتم تسجيل إحصائيات',
	'LIKE_THIS'		=>'مثال',

	//
	'FUNCTIONS_CHECK'		=>'فحص الدوال',
	'RE_CHECK'		=>'إعادة الفحص',
	'FUNCTION_IS_NOT_EXISTS'		=>'الدالة %s معطله لديك.',
	'FUNCTION_IS_EXISTS'		=>'الدالة %s مفعله لديك.',
	'FUNCTION_DISC_UNLINK'		=>'دالة unlink يتم استخدامها لحذف الملفات وأيضا لحذف ملفات الكاش وتحديثها.',
	'FUNCTION_DISC_GD'		=>'دالة imagecreatetruecolor هي من دوال مكتبة GD التي تستخدم لإنشاء مصغرات الصور والكود الأمني , عدم وجود الداله غالبا يعني عدم تواجد مكتبه GD على السيرفر .. ',
	'FUNCTION_DISC_FOPEN'		=>'دالة fopen تستخدم في التحكم بالستايل والملفات في كليجا.',
	'FUNCTION_DISC_MUF'		=>'دالة move_uploaded_file تستخدم لتحميل الملفات  وهي اهم دالة في السكربت.',
	//
	'ADVICES_CHECK'		=>'فحص متقدم (يمكن تثبيت كليجا بدون تحقق هذا الفحص , لكنه مجرد معلومات لك)',
	'ADVICES_REGISTER_GLOBALS'		=>'<span style="color:red;padding:0 6px">خاصية register_globals مفعله !</span><br /> هذه الخاصيه غير محبب تفعيلها ويفضل تعطيلها , ومع هذا فكليجا تحاول تعطيل اثارها برمجياً .',
	'ADVICES_MAGIC_QUOTES'		=>'<span style="color:red;padding:0 6px">خاصية magic_quotes مفعله !</span><br /> هذه الخاصيه غير محبب تفعيلها ويفضل تعطيلها , ومع هذا فكليجا تحاول تعطيل اثارها برمجياً ..',
	
	//UPDATOR
	'INST_CHOOSE_UPDATE_FILE'		=>'قم بإختيار التحديث المناسب لك ومن ثم تابع التحديث ..',
	'INST_ERR_NO_SELECTED_UPFILE_GOOD'		=>'ملف التحديث غير مناسب أو أنه غير موجود من الأساس ! ..',
	'INST_UPDATE_CUR_VER_IS_UP'		=>'نسختك الحالية محدثة لهذا التحديث المحدد.',

	'INST_NOTES_UPDATE'		=>'ملاحظات التحديث',


	
	'INST_UPDATE_IS_FINISH'		=>'معالج التحديث انتهى .. يجب الآن حذف مجلد INSTALL و متابعة عملك في كليجا .',

	'INST_PHP_LESSMIN'		=>'لتثبيت كليجا يجب على الأقل أن يكون لديك اصدار PHP %1$s , وانت لديك اصدار PHP %2$s.',
	'INST_MYSQL_LESSMIN'		=>'لتثبيت كليجا يجب على الأقل أن يكون لديك اصدار MYSQL %1$s , وانت لديك اصدار MYSQL %2$s.',
	'IS_IT_OFFICIAL'		=>'هل قمت بتحميل النسخة من الموقع الرسمي Kleeja.com ؟',
	'IS_IT_OFFICIAL_DESC'		=>'يصلنا الكثير من الشكاوي والتساؤلات عن سبب بعض المشاكل التي تحدث في بعض النسخ ولا نستطيع معرفة المشكلة غالباً , لكن بعد البحث وجدنا ان هناك نسخاً يتم تحميلها من مواقع اخرى غير رسميه وتكون اما معدلة بطريقة بدائية او مزروع داخلها اكواد خبيثه.<span class="sure">لذا , هل انت متأكد من ان نسختك هذه تم تحميلها من الموقع الرسمي : kleeja.com ؟</span>',

	'INST_WHAT_IS_KLEEJA_T'		=>'ماهي كليجا ؟',
	'INST_WHAT_IS_KLEEJA'		=>'Kleeja  تنطق عربياً  "كليجا" ! وكتعريف مبسط "كليجا" سكربت رفع ملفات مجاني يأتي مع خصائص فريده لمساعدة أصحاب المواقع بإمتلاك مركز تحميل قوي ويعتمد عليه  , والحقيقة أن "كليجا" سكربت ضخم الامكانيات سهل الإدارة تم بناء نظام الحماية على مستوى عالي ويملك من الأنظمة المعقدة ما يؤمن لموقعك الحماية التامة بإذن الله !',
	'INST_SPECIAL_KLEEJA'		=>'من أهم مميزات كليجا !',
	'INST_WHAT_IS_KLEEJA_ONE'		=>'1. نظام أعضاء قوي تستطيع ربطه بأغلب السكربتات المستخدمة في المواقع الاجتماعية .<br />2. لوحة تحكم مذهله ليس فقط للتحكم بالملفات ولكن للتحكم  بكل صغيرة وكبيرة  .<br />3. نظام الستايلات البسيط يجعلك تستطيع ان تصنع ستايلك بنفسك.<br />4. مع كليجا ونظام الإضافات البرمجية تستطيع أن تقوم بتركيب الكثير من الاضافات الرائعة .<br />5. ليس هذا فحسب بل كليجا تملك الكثير .. لتعرف أكثر رجاءاً قم بزيارة صفحه <a target="_blank" href="http://ar.kleeja.com/features/">معلومات ومميزات</a> .',
	'YES'		=>'نعم',
	'NO'		=>'لا',

	'KLEEJA_TEAM_MSG_NAME'		=>'فريق تطوير كليجا',
	'KLEEJA_TEAM_MSG_TEXT'		=>"شكراً لاختيارك سكربت الرفع الأول كليجا\n نتمنى حقا ان تستمتع بالسكربت  .\nhttp://www.kleeja.com",

);