<?php
//
// kleeja language, install
// Persian
//


return [
	'DIR'									=> 'rtl',
	'INST_INSTALL_WIZARD'					=> 'نصب برنامه',
	'INST_INSTALL_CLEAN_VER'					=> 'نصب جديد',
	'INST_UPDATE_P_VER'						=> 'بروزرساني ',
	'INST_AGR_LICENSE'						=> 'من قوانين رو ميپذيرم',
	'INST_NEXT'								=> 'بعدي',
	'INST_PREVIOUS'							=> 'بازگشت',
	'INST_SITE_INFO'							=> 'اطلاعات وب سايت',
	'INST_ADMIN_INFO'						=> 'اطلاعات مدير',
	'INST_CHANG_CONFIG'						=> 'لطفا فايل config.php را بررسي کنيد. بايد دسترسي فايل 777 باشد و  اطلاعات ديتا بيس شما در ان وارد شده باشد.',
	'INST_CONNCET_ERR'						=> 'ناتوان در اتصال به سرور...',
	'INST_CONNCET_ERR_SQLITE'               => 'اطمینان حاصل کنید که یک پرونده در پوشه اصلی kliga با نام وجود دارد:%s.',
	'INST_NO_WRTABLE'						=> 'پوشه مورد نظر حق دسترسي نوشتن را ندارد. (در اکثر موارد بايد دسترسي 777 باشد)',
	'INST_GOOD_GO'							=> 'به نظر ميرسيد همه چيز صحيح است... ادامه...!',
	'INST_MSGINS'							=> 'به سرويس آپلودسنتر ما خوش آمديد ، شما مي توانيد تمامي فايل هايي را که از نظر ما مجاز است ، بر روي اين سرور آپلود کنيد',
	'INST_CRT_CALL'							=> 'جدول Comments ساخته شد.',
	'INST_CRT_ONL'							=> 'جدول کاربران انلاين ساخته شد.',
	'INST_CRT_REPRS'							=> 'جدول گزارشات ساخته شد.',
	'INST_CRT_STS'							=> 'جدول امار ساخته شد.',
	'INST_CRT_USRS'							=> 'جدول کاربران ساخته شد.',
	'INST_CRT_ADM'							=> 'جزئيات مدير ساخته شد.',
	'INST_CRT_FLS'							=> 'جدول فايل ها ساخته شد.',
	'INST_CRT_CNF'							=> 'جدول تنظيمات ساخته شد.',
	'INST_CRT_EXT'							=> 'جدول افزونه ها ساخته شد.',
	'INST_CRT_HKS'							=> 'جدول پلاگين ها ساخته شد.',
	'INST_CRT_LNG'							=> 'جدول زبان ها ساخته شد.',
	'INST_CRT_PLG'							=> 'جدول افزونه ها ساخته شد.',
	'INST_SQL_ERR'							=> 'خطا در بروزرساني پايگاه داده..!',
	'INST_FINISH_SQL'						=> 'کليجا با موفقيت نصب شد.',
	'INST_NOTES'								=> 'نکات نصب ..!',
	'INST_END'								=> 'مراحل نصب با موفقيت انجام شد. لطفا براي راه اندازي سايت پوشه Install را حذف نماييد..!',
	'INST_NOTE_D'							=> 'هرگونه مشکل يا سوال خود را با تيم پيشبرد کليجا درميان گذاريد يا در وب سايت رپيدليچ پارسي مطرح نماييد..!',
	'INST_FINISH_ERRSQL'						=> 'متاسفانه ! مشکلي در عمليات بوجود امده است, لطفا دوباره مجددا تلاش نماييد.',
	'INST_KLEEJADEVELOPERS'					=> 'با تشکر از استفاده ي شما از kleeja اميدواريم ساعات خوشي داشته باشيد',
	'SITENAME'								=> 'عنوان وب سايت',
	'SITEURL'								=> 'ادرس وب سايت',
	'SITEMAIL'								=> 'ايميل وب سايت',
	'USERNAME'								=> 'نام کاربري مديريت',
	'PASSWORD'								=> 'کلمه عبور',
	'PASSWORD2'								=> 'تايپ مجدد کلمه عبور',
	'EMAIL'									=> 'پست الکترونيکي',
	'INDEX'									=> 'صفحه اصلي',
	'ADMINCP'								=> 'کنترل پنل',
	'EMPTY_FIELDS'							=> 'لطفا همه اطلاعات ضروري را تکميل نماييد.',
	'WRONG_EMAIL'							=> 'ادرس پست الکترونيکي که وارد کرده ايد معتبر نيست!',

	
	'DB_INFO_NW'								=> 'اطلاعات ديتابيس خود را با دقت وارد کرده..سپس بر روي گزينه بعدي کليک نماييد و نصاب براي شما  فايل config.php را خواهد ساخت.سپس ان را در دايرکتوري اصلي اپلود نماييد..!',
	'DB_INFO'								=> 'اطلاعات ديتابيس را وارد نماييد..!',
	'DB_SERVER'								=> 'هاست (ميزبان)',
	'DB_TYPE'								=> 'نوع ديتابيس',
	'DB_TYPE_MYSQL'							=> 'MySQL Standard',
	'DB_TYPE_MYSQLI'							=> 'MySQL Improved',
	'DB_USER'								=> 'نام کاربري ديتابيس',
	'DB_PASSWORD'							=> 'کلمه عبور ديتابيس',
	'DB_NAME'								=> 'نام ديتابيس',
	'DB_PREFIX'								=> 'پيشوند جداول (Tables prefix)',
	'VALIDATING_FORM_WRONG'					=> 'لطفا همه فيلدهاي مورد نياز را کامل کنيد..!',
	'CONFIG_EXISTS'							=> 'فايل Config.php يافت شد,ادامه...',
	'INST_SUBMIT_CONFIGOK'					=> 'فايل را در پوشه اصلي اپلود نماييد.',
	'INST_EXPORT'							=> 'برون ريزي فايل (دريافت فايل اماده)',
	'INST_OTHER_INFO'						=> 'ديگر اطلاعات',
	'URLS_TYPES'								=> 'نحوه ادرس دهي فايل ها',
	'DEFAULT'								=> 'پيش فرض',
	'FILENAME_URL'							=> 'بر اساس نام فايل',
	'DIRECT_URL'								=> 'لينک مستقيم',
	'LIKE_THIS'								=> 'مثال: ',


	'FUNCTIONS_CHECK'						=> 'چک کردن توابع ضروري',
	'RE_CHECK'								=> 'چک کردن مجدد',
	'FUNCTION_IS_NOT_EXISTS'					=> 'تابع % غيرفعال است.',
	'FUNCTION_IS_EXISTS'						=> 'تابع %s فعال است .',
	'FUNCTION_DISC_UNLINK'					=> 'تابع Unlink براي حذف و برزرساني کش فايل ها به کار ميرود.',
	'FUNCTION_DISC_GD'						=> 'تابع  imagecreatetruecolor تابعي از کتابخانه GD هست ، که تصاوير بندانگشتي مي سازد و عکس ها را کنترل مي کند',
	'FUNCTION_DISC_FOPEN'					=> 'تابع fopen کنترل استايل ها و فايل ها را در کليجا به عهده دارد.',
	'FUNCTION_DISC_MUF'						=> '	تابع move_uploaded_file باري آپلود فايل ها مورد استفاده قرار مي گيرد و يکي از مهمترين توابع اين برنامه (کليجا) است.',

	'ADVICES_CHECK'							=> 'چک کردن پيشرفته (اختياري)',
	'ZIPARCHIVE_LIB'                        => '<span style = "color: red؛ padding: 0 6px"> كتابخانه ZipArchive بر روي سرور شما در دسترس نيست!',
	
	//UPDATOR
	'INST_UPDATE_CUR_VER_IS_UP'				=> 'نسخه فعلي شما از اين اپديت , بروز تر است..!',


	'INST_UPDATE_IS_FINISH'					=> 'نصب با موفقيت به پايان رسيد!لطفا پوشه INSTALL را پاک کنيد.',

	'INST_PHP_LESSMIN'						=> 'شما به php %1$s يا بالاتر احتياج داريد ، نسخه فعلي شما %2$s است',
	'INST_MYSQL_LESSMIN'			 		=> 'شما به  MySQL %1$s يا بالاتر احتياج داريد ، نسخه فعلي شما %2$است',
	'IS_IT_OFFICIAL'						=> 'آيا اين نسخه را مستقيما از سايت اصلي دانلود کرديد؟',
	'IS_IT_OFFICIAL_DESC'					=> 'ما گزارش هايي از نقاط مختلف دريافت کرديم که باگ ها و مشکلات زيادي در سيستم کليجا وجود دارد، اما همگي آنها ناشي از اين بوده که فايل ، از سايت اصلي ما دريافت نشده<br /><br /> <fon style="color:#154188;border-bottom:1px dashed #154188;padding:4px 0;"> بنابر اين ، آيا شما مطمئنيد که اين فايل را از سايت اصلي دانلود کرده ايد؟</font>',
	
	'INST_WHAT_IS_KLEEJA_T'                 => 'کلیگا چیست؟',
	'INST_WHAT_IS_KLEEJA'					=> 'کليجا رايگان است ، برنامه ايست که بوسيله آن مي توانيد سايت آپلودسنتر عکس و فايل داشته باشيد ، هدف از ايجاد پروژه کليجا ، کمک به وبمستران براي داشتن سيستم آپلودسنتر قوي و آراسته بوده است.کليجا سورس کد هاي قابل خواندن وآساني  دارد و سيستمي قوي و کاربرگراست  ، همچنين از سيستم template base پشتيباني مي کند و شما مي توانيد به راحتي استايل هاي آن را ويرايش کنيد ',
	'INST_SPECIAL_KLEEJA'					=> 'برخي از ويژگي هاي کليجا..!',
	'INST_WHAT_IS_KLEEJA_ONE'				=> '	کليجا سيستم مديريتي و کاربرگرايي فوق العاده قوي برخوردار است ،سيستم مديريتي آن بسيار ساده است و بوسيله آن مي توان کنترل کاملي روي وبسايت داشت ، همچنين مي توان به راحتي براي آن پوسته ساخت، يا پوسته هاي آن را ويرايش کرد. نکته ي حائز اهميت بعدي ، امکان نصب انواع اضافات و پلاگين هاست که با مراجعه به <a target="_blank" href="http://www.kleeja.com/about/">سايت اصلي </a>مي توان آنها را دانلود و استفاده کرد',
	'YES'									=> 'بلي',
	'NO'										=> 'خير',

	'KLEEJA_TEAM_MSG_NAME'					=> 'تيم پيشبرنده کليجا',
	'KLEEJA_TEAM_MSG_TEXT'					=> "با تشکر از شما براي انتخاب کليجا براي اپلود سنتر خود,\n ما اميدواريم شما از امکانات کليجا حد اکثر بهره را ببريد..\n براي دريافت اسکريپت هاي ديگر فراموش نکنيد که به http://www.dverleech.com  سر بزنيد.",

];
